<?php

use Illuminate\Database\Seeder;
use Carbon\Carbon;

class MachinesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $arr = ['รถตัก #1','รถตัก #2','รถแบคโฮ #1','รถแบคโฮ #2','รถแบคโฮ #3','รถแบคโฮ #4','รถแบคโฮ #5',
                'รถเจาะ #1','รถเจาะ #2','รถดั้ม #1','รถดั้ม #2','รถดั้ม #3','รถดั้ม #4','รถดั้ม #5','รถดั้ม #6',
                'รถพ่วง #7','รถพ่วง #8','รถพ่วง #9','รถพ่วง #10','รถพ่วง #11','รถพ่วง #12','รถพ่วง #13','รถพ่วง #14',
                'รถพ่วง #15','รถพ่วง #16','รถน้ำ','รถเฮี๊ยบ','รถกระบะ สีเทา','รถกระบะ สีน้ำเงิน','รถกระบะ สีขาว','อื่นๆ',
                'โรงโม่หลัก','โรงโม่ PXJ','สถานที่','ใช้ภายในออฟฟิส',];

        for($i = 0; $i<count($arr); $i++){
            DB::table('machines')->insert([
                'name' => $arr[$i],
                'user_id' => 1,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ]);
        }
    }
}
